#include<iostream>
#include<Windows.h>

int main()
{
	using namespace std;
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "Привіт! Гарний і чудовий ранок :)\n";

	//Для роботи з циклом for є спеціальний синтексисйого запису

	//int i = 0;
	//i = i + 1 //так писати не зручно
	//i++; //аналогічно як i = i + 1; - оператор інкременту
	//i = i - 1; // зменшення на 1
	//i--; // аналогічно, що i = i - 1;
	// ЩО робить цикл - повтор декілька разів 1 туж самц операцію
	// кількість постворів, може визначати, якась змінна n
	// { -- початок роботи циклу - тіла його
	// ... тіло циклу - блок коду в циклі
	// } -- кінець тіла циклу
	// ініціалізація_змінних_циклу - виконується 1 раз під час початку циклу
	// умова_ продовження_циклу - перевіряється на кожєній ітераціїї циклу
	//лічильник+циклу - змінює крок роботи циклу - виконується кожен раз після тіла циклу
	//зробимо циклу, який виводиться числа від 1 до 10
	int n = 10; //визначає кількість ітерації циклу
	for (int i = 1; i <= 10; i++)// циклу - де пропущені усі блоки for (;;) - вічний цикл
	{
		cout << i << '\t'; //беремо в '' - якщо це 1 символ
	}

	return 0;
}